
{
	"format": "layers-model",
	"generatedBy": "keras v2.2.4",
	"convertedBy": "TensorFlow.js Converter v1.2.9",
	"modelTopology": {
		"keras_version": "2.2.4",
		"backend": "tensorflow",
		"model_config": {
			"class_name": "Sequential",
			"config": {
				"name": "sequential_2",
				"layers": [
					{
						"class_name": "Flatten",
						"config": {
							"name": "flatten_3",
							"trainable": true,
							"batch_input_shape": [
								null,
								1,
								2
							],
							"dtype": "float32",
							"data_format": "channels_last"
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_9",
							"trainable": true,
							"units": 16,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "VarianceScaling",
								"config": {
									"scale": 1.0,
									"mode": "fan_avg",
									"distribution": "uniform",
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_9",
							"trainable": true,
							"activation": "relu"
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_10",
							"trainable": true,
							"units": 16,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "VarianceScaling",
								"config": {
									"scale": 1.0,
									"mode": "fan_avg",
									"distribution": "uniform",
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_10",
							"trainable": true,
							"activation": "relu"
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_11",
							"trainable": true,
							"units": 16,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "VarianceScaling",
								"config": {
									"scale": 1.0,
									"mode": "fan_avg",
									"distribution": "uniform",
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_11",
							"trainable": true,
							"activation": "relu"
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_12",
							"trainable": true,
							"units": 2,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "VarianceScaling",
								"config": {
									"scale": 1.0,
									"mode": "fan_avg",
									"distribution": "uniform",
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_12",
							"trainable": true,
							"activation": "linear"
						}
					}
				]
			}
		},
		"training_config": {
			"optimizer_config": {
				"class_name": "SGD",
				"config": {
					"lr": 0.009999999776482582,
					"momentum": 0.0,
					"decay": 0.0,
					"nesterov": false
				}
			},
			"loss": "mse",
			"metrics": [],
			"sample_weight_mode": null,
			"loss_weights": null
		}
	},
	"weightsManifest": [
		{
			"paths": [
				"build_runner/debug/html5/runner_goto_actor.bin"
			],
			"weights": [
				{
					"name": "dense_10/kernel",
					"shape": [
						16,
						16
					],
					"dtype": "float32"
				},
				{
					"name": "dense_10/bias",
					"shape": [
						16
					],
					"dtype": "float32"
				},
				{
					"name": "dense_11/kernel",
					"shape": [
						16,
						16
					],
					"dtype": "float32"
				},
				{
					"name": "dense_11/bias",
					"shape": [
						16
					],
					"dtype": "float32"
				},
				{
					"name": "dense_12/kernel",
					"shape": [
						16,
						2
					],
					"dtype": "float32"
				},
				{
					"name": "dense_12/bias",
					"shape": [
						2
					],
					"dtype": "float32"
				},
				{
					"name": "dense_9/kernel",
					"shape": [
						2,
						16
					],
					"dtype": "float32"
				},
				{
					"name": "dense_9/bias",
					"shape": [
						16
					],
					"dtype": "float32"
				}
			]
		}
	]
}